radiolinkW/ChibiOS/os/hal/ports/HC32/LLD/OTGv1/hc32_otg.h
/**
 *******************************************************************************
 * @file  hc32f4a0_usb_core_regs.h
 * @brief A detailed description is available at hardware registers
 @verbatim
   Change Logs:
   Date             Author          Notes
   2018-12-26       CDT             First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#ifndef __USB_CORE_REGS_H__
#define __USB_CORE_REGS_H__

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include <stdint.h>
//#include "usb_app_conf.h"

/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
#ifndef __IO
    #define     __IO    volatile
#endif

#define USB_MAX_TX_FIFOS                 (16u)

#define USB_HS_MAX_PACKET_SIZE           (512u)
#define USB_FS_MAX_PACKET_SIZE           (64u)
#define USB_MAX_EP0_SIZE                 (64u)

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/

typedef struct   
{
    __IO uint32_t GOTGCTL;                    /* Control and Status Register                      000h*/
    __IO uint32_t GOTGINT;                    /* Interrupt Register                               004h*/
    __IO uint32_t GAHBCFG;                    /* AHB Configuration Register                       008h*/
    __IO uint32_t GUSBCFG;                    /* USB Configuration Register                       00Ch*/
    __IO uint32_t GRSTCTL;                    /* Reset Register                                   010h*/
    __IO uint32_t GINTSTS;                    /* Interrupt Register                               014h*/
    __IO uint32_t GINTMSK;                    /* Interrupt Mask Register                          018h*/
    __IO uint32_t GRXSTSR;                    /* Receive Sts Q Read Register                      01Ch*/
    __IO uint32_t GRXSTSP;                    /* Receive Sts Q Read & POP Register                020h*/
    __IO uint32_t GRXFSIZ;                    /* Receive FIFO Size Register                       024h*/
    __IO uint32_t GNPTXFSIZ;                  /* Non-Periodic Transmit FIFO Size Register         028h*/
    __IO uint32_t GNPTXSTS;                   /* Non Periodic Transmit FIFO/Queue Status Register 02Ch*/
    __IO uint32_t GI2CCTL;                    /* I2C Access Register                              030h*/
    __IO uint32_t GPVNDCTL;                   /* PHY Vendor Control Register                      034h*/
    __IO uint32_t GGPIO;                      /* General Purpose Input/Output Register            038h*/
    __IO uint32_t GUID;                       /* User ID Register                                 03Ch*/
    uint32_t  Reserved40[48];                 /* Reserved                                    040h-0FFh*/
    __IO uint32_t HPTXFSIZ;                   /* Host Periodic Transmit FIFO Size Register        100h*/
    __IO uint32_t DPTXFSIZ[USB_MAX_TX_FIFOS]; /* Device Periodic Transmit FIFO Size Register          */
}USB_CORE_GREGS;

typedef struct 
{
    volatile uint32_t DCFG;         /* Device Configuration Register                     800h*/
    volatile uint32_t DCTL;         /* Device Control Register                           804h*/
    volatile uint32_t DSTS;         /* Device Status Register (RO)                       808h*/
    uint32_t Reserved0C;            /* Reserved                                          80Ch*/
    volatile uint32_t DIEPMSK;      /* Device IN EP Common Interrupt Mask Register       810h*/
    volatile uint32_t DOEPMSK;      /* Device OUT EP Common Interrupt Mask Register      814h*/
    volatile uint32_t DAINT;        /* Device All EP Interrupt Register                  818h*/
    volatile uint32_t DAINTMSK;     /* Device All EP Interrupt Mask Register             81Ch*/
    uint32_t  Reserved20;           /* Reserved                                          820h*/
    uint32_t Reserved9;             /* Reserved                                          824h*/
    volatile uint32_t DVBUSDIS;     /* Device VBUS Discharge Time Register               828h*/
    volatile uint32_t DVBUSPULSE;   /* Device VBUS Pulsing Time Register                 82Ch*/
    volatile uint32_t DTHRCTL;      /* Device Threshold Control Register                 830h*/
    volatile uint32_t DIEPEMPMSK;   /* Device IN EP FIFO Empty Interrupt Mask Register   834h*/
    volatile uint32_t DEACHINT;     /* Deivce Each EP Interrupt Register                 838h*/
    volatile uint32_t DEACHINTMSK;  /* Device Each EP Interrupt Mask Register            83Ch*/
}USB_CORE_DREGS;

typedef struct 
{
    volatile uint32_t DIEPCTL; /* dev IN Endpoint Control Reg 900h + (ep_num * 20h) + 00h*/
    uint32_t Reserved04;             /* Reserved                       900h + (ep_num * 20h) + 04h*/
    volatile uint32_t DIEPINT; /* dev IN Endpoint Itr Reg     900h + (ep_num * 20h) + 08h*/
    uint32_t Reserved0C;             /* Reserved                       900h + (ep_num * 20h) + 0Ch*/
    volatile uint32_t DIEPTSIZ; /* IN Endpoint Txfer Size   900h + (ep_num * 20h) + 10h*/
    volatile uint32_t DIEPDMA; /* IN Endpoint DMA Address Reg    900h + (ep_num * 20h) + 14h*/
    volatile uint32_t DTXFSTS;/*IN Endpoint Tx FIFO Status Reg 900h + (ep_num * 20h) + 18h*/
    uint32_t Reserved18;             /* Reserved  900h+(ep_num*20h)+1Ch-900h+ (ep_num * 20h) + 1Ch*/
}USB_CORE_INEPREGS;

typedef struct 
{
    volatile uint32_t DOEPCTL;       /* dev OUT Endpoint Control Reg  B00h + (ep_num * 20h) + 00h*/
    uint32_t Reserved04;         /* Reserved                      B00h + (ep_num * 20h) + 04h*/
    volatile uint32_t DOEPINT;       /* dev OUT Endpoint Itr Reg      B00h + (ep_num * 20h) + 08h*/
    uint32_t Reserved0C;         /* Reserved                      B00h + (ep_num * 20h) + 0Ch*/
    volatile uint32_t DOEPTSIZ;      /* dev OUT Endpoint Txfer Size   B00h + (ep_num * 20h) + 10h*/
    volatile uint32_t DOEPDMA;       /* dev OUT Endpoint DMA Address  B00h + (ep_num * 20h) + 14h*/
    uint32_t Reserved18[2];      /* Reserved B00h + (ep_num * 20h) + 18h - B00h + (ep_num * 20h) + 1Ch*/
}USB_CORE_OUTEPREGS;

typedef struct 
{
    volatile uint32_t HCFG;             /* Host Configuration Register    400h*/
    volatile uint32_t HFIR;      /* Host Frame Interval Register   404h*/
    volatile uint32_t HFNUM;         /* Host Frame Nbr/Frame Remaining 408h*/
    uint32_t Reserved40C;                   /* Reserved                       40Ch*/
    volatile uint32_t HPTXSTS;   /* Host Periodic Tx FIFO/ Queue Status 410h*/
    volatile uint32_t HAINT;   /* Host All Channels Interrupt Register 414h*/
    volatile uint32_t HAINTMSK;   /* Host All Channels Interrupt Mask 418h*/
}USB_CORE_HREGS;

typedef struct 
{
    volatile uint32_t HCCHAR;
    volatile uint32_t HCSPLT;
    volatile uint32_t HCINT;
    volatile uint32_t HCINTMSK;
    volatile uint32_t HCTSIZ;
    volatile uint32_t HCDMA;
    uint32_t Reserved[2];
}USB_CORE_HC_REGS;

typedef struct //000h
{
    USB_CORE_GREGS         *GREGS;
    USB_CORE_DREGS         *DREGS;
    USB_CORE_HREGS         *HREGS;
    USB_CORE_INEPREGS      *INEP_REGS[USB_MAX_TX_FIFOS];
    USB_CORE_OUTEPREGS     *OUTEP_REGS[USB_MAX_TX_FIFOS];
    USB_CORE_HC_REGS       *HC_REGS[USB_MAX_TX_FIFOS];
    volatile uint32_t     *HPRT0;
    volatile uint32_t     *DFIFO[USB_MAX_TX_FIFOS];
    volatile uint32_t     *PCGCCTL;
}HD_USB_REGS;

typedef union 
{
    uint32_t d32;
    struct
    {
        unsigned sesreqscs:1;
        unsigned sesreq:1;
        unsigned vbvalidoven:1;
        unsigned vbvalidovval:1;
        unsigned avalidoven:1;
        unsigned avalidovval:1;
        unsigned bvalidoven:1;
        unsigned bvalidovval:1;
        unsigned hstnegscs:1;
        unsigned hnpreq:1;
        unsigned hstsethnpen:1;
        unsigned devhnpen:1;
        unsigned reserved12_15:4;
        unsigned conidsts:1;
        unsigned dbnctime:1;
        unsigned asesvld:1;
        unsigned bsesvld:1;
        unsigned otgver:1;
        unsigned reserved1:1;
        unsigned multvalidbc:5;
        unsigned chirpen:1;
        unsigned reserved28_31:4;
    }
    b;
} USB_CORE_GOTGCTL_TypeDef ;

typedef union 
{
    uint32_t d32;
    struct
    {
        /** Current Mode */
        unsigned reserved0_1:2;

        /** Session End Detected */
        unsigned sesenddet:1;

        unsigned reserved3_7:5;

