radiolinkW/ChibiOS/os/hal/ports/HC32/LLD/OTGv1/hc32_otg.h
        /** Session Request Success Status Change */
        unsigned sesreqsucstschng:1;
        /** Host Negotiation Success Status Change */
        unsigned hstnegsucstschng:1;

        unsigned reserved10_16:7;

        /** Host Negotiation Detected */
        unsigned hstnegdet:1;
        /** A-Device Timeout Change */
        unsigned adevtoutchng:1;
        /** Debounce Done */
        unsigned debdone:1;
        /** Multi-Valued input changed */
        unsigned mvic:1;

        unsigned reserved31_21:11;
    }
    b;
} USB_CORE_GOTGINT_TypeDef ;
typedef union 
{
    uint32_t d32;
    struct
    {
        unsigned glblintrmsk:1;
#define DWC_GAHBCFG_GLBINT_ENABLE           (1u)

        unsigned hburstlen:4;
#define DWC_GAHBCFG_INT_DMA_BURST_SINGLE    (0u)
#define DWC_GAHBCFG_INT_DMA_BURST_INCR      (1u)
#define DWC_GAHBCFG_INT_DMA_BURST_INCR4     (3u)
#define DWC_GAHBCFG_INT_DMA_BURST_INCR8     (5u)
#define DWC_GAHBCFG_INT_DMA_BURST_INCR16    (7u)

        unsigned dmaenable:1;
#define DWC_GAHBCFG_DMAENABLE               (1u)
        unsigned reserved:1;
        unsigned nptxfemplvl_txfemplvl:1;
        unsigned ptxfemplvl:1;
#define DWC_GAHBCFG_TXFEMPTYLVL_EMPTY       (1u)
#define DWC_GAHBCFG_TXFEMPTYLVL_HALFEMPTY   (0u)
        unsigned reserved9_20:12;
        unsigned remmemsupp:1;
        unsigned notialldmawrit:1;
        unsigned ahbsingle:1;
        unsigned reserved24_31:8;
  }
  b;
} USB_CORE_GAHBCFG_TypeDef ;

typedef union 
{
    uint32_t d32;
    struct
    {
        unsigned toutcal:3;
        unsigned phyif:1;
        unsigned ulpi_utmi_sel:1;
        unsigned fsintf:1;
        unsigned physel:1;
        unsigned ddrsel:1;
        unsigned srpcap:1;
        unsigned hnpcap:1;
        unsigned usbtrdtim:4;
        unsigned reserved1:1;
        unsigned phylpwrclksel:1;
        unsigned otgutmifssel:1;
        unsigned ulpi_fsls:1;
        unsigned ulpi_auto_res:1;
        unsigned ulpi_clk_sus_m:1;
        unsigned ulpi_ext_vbus_drv:1;
        unsigned ulpi_int_vbus_indicator:1;
        unsigned term_sel_dl_pulse:1;
        unsigned indicator_complement:1;
        unsigned indicator_pass_through:1;
        unsigned ulpi_int_prot_dis:1;
        unsigned ic_usb_cap:1;
        unsigned ic_traffic_pull_remove:1;
        unsigned tx_end_delay:1;
        unsigned force_host_mode:1;
        unsigned force_dev_mode:1;
        unsigned reserved31:1;
    }
    b;
} USB_CORE_GUSBCFG_TypeDef ;

typedef struct 
{
    /** Core Soft Reset (CSftRst) (Device and Host)
    *
    * The application can flush the control logic in the
    * entire core using this bit. This bit resets the
    * pipelines in the AHB Clock domain as well as the
    * PHY Clock domain.
    *
    * The state machines are reset to an IDLE state, the
    * control bits in the CSRs are cleared, all the
    * transmit FIFOs and the receive FIFO are flushed.
    *
    * The status mask bits that control the generation of
    * the interrupt, are cleared, to clear the
    * interrupt. The interrupt status bits are not
    * cleared, so the application can get the status of
    * any events that occurred in the core after it has
    * set this bit.
    *
    * Any transactions on the AHB are terminated as soon
    * as possible following the protocol. Any
    * transactions on the USB are terminated immediately.
    *
    * The configuration settings in the CSRs are
    * unchanged, so the software doesn't have to
    * reprogram these registers (Device
    * Configuration/Host Configuration/Core System
    * Configuration/Core PHY Configuration).
    *
    * The application can write to this bit, any time it
    * wants to reset the core. This is a self clearing
    * bit and the core clears this bit after all the
    * necessary logic is reset in the core, which may
    * take several clocks, depending on the current state
    * of the core.
    */
    unsigned csftrst:1;
    /** Hclk Soft Reset
    *
    * The application uses this bit to reset the control logic in
    * the AHB clock domain. Only AHB clock domain pipelines are
    * reset.
    */
    unsigned hsftrst:1;
    /** Host Frame Counter Reset (Host Only)<br>
    *
    * The application can reset the (micro)frame number
    * counter inside the core, using this bit. When the
    * (micro)frame counter is reset, the subsequent SOF
    * sent out by the core, will have a (micro)frame
    * number of 0.
    */
    unsigned hstfrm:1;
    /** In Token Sequence Learning Queue Flush
    * (INTknQFlsh) (Device Only)
    */
    unsigned intknqflsh:1;
    /** RxFIFO Flush (RxFFlsh) (Device and Host)
    *
    * The application can flush the entire Receive FIFO
    * using this bit. The application must first
    * ensure that the core is not in the middle of a
    * transaction. The application should write into
    * this bit, only after making sure that neither the
    * DMA engine is reading from the RxFIFO nor the MAC
    * is writing the data in to the FIFO. The
    * application should wait until the bit is cleared
    * before performing any other operations. This bit
    * will takes 8 clocks (slowest of PHY or AHB clock)
    * to clear.
    */
    unsigned rxfflsh:1;
    /** TxFIFO Flush (TxFFlsh) (Device and Host).
    *
    * This bit is used to selectively flush a single or
    * all transmit FIFOs. The application must first
    * ensure that the core is not in the middle of a
    * transaction. The application should write into
    * this bit, only after making sure that neither the
    * DMA engine is writing into the TxFIFO nor the MAC
    * is reading the data out of the FIFO. The
    * application should wait until the core clears this
    * bit, before performing any operations. This bit
    * will takes 8 clocks (slowest of PHY or AHB clock)
    * to clear.
    */
    unsigned txfflsh:1;

    /** TxFIFO Number (TxFNum) (Device and Host).
    *
    * This is the FIFO number which needs to be flushed,
    * using the TxFIFO Flush bit. This field should not
    * be changed until the TxFIFO Flush bit is cleared by
    * the core.
    *    - 0x0 : Non Periodic TxFIFO Flush
    *    - 0x1 : Periodic TxFIFO #1 Flush in device mode
    *      or Periodic TxFIFO in host mode
    *    - 0x2 : Periodic TxFIFO #2 Flush in device mode.
    *    - ...
    *    - 0xF : Periodic TxFIFO #15 Flush in device mode
    *    - 0x10: Flush all the Transmit NonPeriodic and
    *      Transmit Periodic FIFOs in the core
    */
    unsigned txfnum:5;
    /** Reserved */
    unsigned reserved11_29:19;
    /** DMA Request Signal.  Indicated DMA request is in
    * probress. Used for debug purpose. */
    unsigned dmareq:1;
    /** AHB Master Idle.  Indicates the AHB Master State
    * Machine is in IDLE condition. */
    unsigned ahbidle:1;
}USB_CORE_GRSTCTL_TypeDef; 
typedef union 
{
    uint32_t d32;
    USB_CORE_GRSTCTL_TypeDef b; 
} USB_GRSTCTL_TypeDef;

typedef union 
{
    uint32_t d32;
    struct
    {
        unsigned reserved0:1;
        unsigned modemismatch:1;
        unsigned reserved:1;
        unsigned sofintr:1;
        unsigned rxstsqlvl:1;
        unsigned nptxfempty:1;
        unsigned ginnakeff:1;
        unsigned goutnakeff:1;
        unsigned ulpickint:1;
        unsigned i2cintr:1;
        unsigned erlysuspend:1;
        unsigned usbsuspend:1;
        unsigned usbreset:1;
        unsigned enumdone:1;
        unsigned isooutdrop:1;
        unsigned eopframe:1;
        unsigned restoredone:1;
        unsigned epmismatch:1;
        unsigned inepintr:1;
        unsigned outepintr:1;
        unsigned incomplisoin:1;
        unsigned incomplisoout:1;
        unsigned fetsusp:1;
        unsigned resetdet:1;
        unsigned portintr:1;
        unsigned hcintr:1;
        unsigned ptxfempty:1;
        unsigned lpmtranrcvd:1;
        unsigned conidstschng:1;
        unsigned disconnect:1;
        unsigned vbusvint:1;
        unsigned wkupintr:1;
    }
    b;
} USB_CORE_GINTMSK_TypeDef;

typedef struct 
{
    unsigned curmode:1;
    unsigned modemismatch:1;
    unsigned reserved:1;
    unsigned sofintr:1;
    unsigned rxstsqlvl:1;
    unsigned nptxfempty:1;
    unsigned ginnakeff:1;
    unsigned goutnakeff:1;
    unsigned ulpickint:1;
    unsigned i2cintr:1;
    unsigned erlysuspend:1;
    unsigned usbsuspend:1;
    unsigned usbreset:1;
    unsigned enumdone:1;
    unsigned isooutdrop:1;
    unsigned eopframe:1;
    unsigned restoredone:1;
    unsigned epmismatch:1;
    unsigned inepint:1;
    unsigned outepintr:1;
    unsigned incomplisoin:1;
    unsigned incomplisoout:1;
    unsigned fetsusp:1;
    unsigned resetdet:1;
    unsigned portintr:1;
    unsigned hcintr:1;
    unsigned ptxfempty:1;
    unsigned lpmtranrcvd:1;
    unsigned conidstschng:1;
    unsigned disconnect:1;
    unsigned vbusvint:1;
    unsigned wkupintr:1;
}stc_bUSB_CORE_GINTSTS_t;   
typedef union 
{
    uint32_t d32;
    stc_bUSB_CORE_GINTSTS_t b;  
} USB_CORE_GINTSTS_TypeDef ;

typedef struct 
{
    unsigned epnum:4;
    unsigned bcnt:11;
    unsigned dpid:2;

#define DWC_STS_DATA_UPDT       (0x2) // OUT Data Packet
#define DWC_STS_XFER_COMP       (0x3) // OUT Data Transfer Complete

#define DWC_DSTS_GOUT_NAK       (0x1) // Global OUT NAK
#define DWC_DSTS_SETUP_COMP     (0x4) // Setup Phase Complete
#define DWC_DSTS_SETUP_UPDT     (0x6) // SETUP Packet
    unsigned pktsts:4;
    unsigned fn:4;
    unsigned reserved25_31:7;
}stc_bUSB_CORE_DRXSTS_t; /* C-STAT */
typedef union 
{
    uint32_t d32;
    stc_bUSB_CORE_DRXSTS_t b;  /* C-STAT */
} USB_CORE_DRXSTS_TypeDef;

typedef struct 
{
    unsigned chnum:4;
    unsigned bcnt:11;
    unsigned dpid:2;

    unsigned pktsts:4;
#define DWC_GRXSTS_PKTSTS_IN                (0x2)
#define DWC_GRXSTS_PKTSTS_IN_XFER_COMP      (0x3)
#define DWC_GRXSTS_PKTSTS_DATA_TOGGLE_ERR   (0x5)
#define DWC_GRXSTS_PKTSTS_CH_HALTED         (0x7)

    unsigned reserved21_31:11;
}stc_bUSB_CORE_GRXSTS_t;  /* C-STAT */
typedef union 
{
    uint32_t d32;
    stc_bUSB_CORE_GRXSTS_t b;  
} USB_CORE_GRXFSTS_TypeDef ;

typedef struct 
{
    unsigned startaddr:16;
    unsigned depth:16;
}stc_bUSB_CORE_FSIZ_t; 
typedef union 
{
    uint32_t d32;
    stc_bUSB_CORE_FSIZ_t b;  /* C-STAT */
} USB_CORE_FSIZ_TypeDef;

typedef struct 
{
    unsigned nptxfspcavail:16;
    unsigned nptxqspcavail:8;
    /** Top of the Non-Periodic Transmit Request Queue
    *   - bit 24 - Terminate (Last entry for the selected
    *     channel/EP)
    *   - bits 26:25 - Token Type
    *     - 2'b00 - IN/OUT
    *     - 2'b01 - Zero Length OUT
    *     - 2'b10 - PING/Complete Split
    *     - 2'b11 - Channel Halt
    *   - bits 30:27 - Channel/EP Number
    */
    unsigned nptxqtop_terminate:1;
    unsigned nptxqtop_token:2;
    unsigned nptxqtop_chnep:4;
    unsigned reserved:1;
}stc_bUSB_CORE_HNPTXSTS_t;  
typedef union 
{
    uint32_t d32;
    stc_bUSB_CORE_HNPTXSTS_t b;  
} USB_CORE_HNPTXSTS_TypeDef;

typedef struct 
{
    unsigned txfspcavail:16;
    unsigned reserved:16;
}stc_bUSB_CORE_DTXFSTSn_t;  
typedef union 
{
    uint32_t d32;
    stc_bUSB_CORE_DTXFSTSn_t b;  
} USB_CORE_DTXFSTSn_TypeDef ;

typedef union 
{
    uint32_t d32;
    struct
    {
        unsigned rwdata:8;
        unsigned regaddr:8;
        unsigned addr:7;
        unsigned i2cen:1;
        unsigned ack:1;
        unsigned i2csuspctl:1;
        unsigned i2cdevaddr:2;
        unsigned i2cdatse0:1;
        unsigned reserved:1;
        unsigned rw:1;
        unsigned bsydne:1;
    }
    b;
} USB_CORE_GI2CCTL_TypeDef;

typedef union 
{
    /** raw register data */
    uint32_t d32;
    /** register bits */
    struct {
        unsigned regdata:8;
        unsigned vctrl:8;
        unsigned regaddr16_21:6;
        unsigned regwr:1;
        unsigned reserved23_24:2;
        unsigned newregreq:1;
        unsigned vstsbsy:1;
        unsigned vstsdone:1;
        unsigned reserved28_30:3;
        unsigned disulpidrvr:1;
    } b;
} USB_CORE_GPVNDCTL_TypeDef;


typedef union 
{
    uint32_t d32;
    struct
    {
        /** Device Speed */
        unsigned devspd:2;
        /** Non Zero Length Status OUT Handshake */
        unsigned nzstsouthshk:1;
#define DWC_DCFG_SEND_STALL 1

        unsigned ena32khzs:1;
        /** Device Addresses */
        unsigned devaddr:7;
        /** Periodic Frame Interval */
        unsigned perfrint:2;
#define DWC_DCFG_FRAME_INTERVAL_80 (0u)
#define DWC_DCFG_FRAME_INTERVAL_85 (1u)
#define DWC_DCFG_FRAME_INTERVAL_90 (2u)
#define DWC_DCFG_FRAME_INTERVAL_95 (3u)

        /** Enable Device OUT NAK for bulk in DDMA mode */
        unsigned endevoutnak:1;

        unsigned reserved14_17:4;
        /** In Endpoint Mis-match count */
        unsigned epmscnt:5;
        /** Enable Descriptor DMA in Device mode */
        unsigned descdma:1;
        unsigned perschintvl:2;
        unsigned resvalid:6;
    }
    b;
} USB_CORE_DCFG_TypeDef;

typedef union 
{
    uint32_t d32;
    struct
    {
        /** Remote Wakeup */
        unsigned rmtwkupsig:1;
        /** Soft Disconnect */
        unsigned sftdiscon:1;
        /** Global Non-Periodic IN NAK Status */
        unsigned gnpinnaksts:1;
        /** Global OUT NAK Status */
        unsigned goutnaksts:1;
        /** Test Control */
        unsigned tstctl:3;
        /** Set Global Non-Periodic IN NAK */
        unsigned sgnpinnak:1;
        /** Clear Global Non-Periodic IN NAK */
        unsigned cgnpinnak:1;
        /** Set Global OUT NAK */
        unsigned sgoutnak:1;
        /** Clear Global OUT NAK */
        unsigned cgoutnak:1;
        /** Power-On Programming Done */
        unsigned pwronprgdone:1;
        /** Reserved */
        unsigned reserved:1;
        /** Global Multi Count */
        unsigned gmc:2;
        /** Ignore Frame Number for ISOC EPs */
        unsigned ifrmnum:1;
        /** NAK on Babble */
        unsigned nakonbble:1;
        /** Enable Continue on BNA */
        unsigned encontonbna:1;
        /** Enable deep sleep besl reject feature*/
        unsigned besl_reject:1;

        unsigned reserved17_31:13;
    }
    b;
} USB_CORE_DCTL_TypeDef;

typedef struct 
{
            /** Suspend Status */
            unsigned suspsts:1;
            /** Enumerated Speed */
            unsigned enumspd:2;
#define DWC_DSTS_ENUMSPD_HS_PHY_30MHZ_OR_60MHZ (0u)
#define DWC_DSTS_ENUMSPD_FS_PHY_30MHZ_OR_60MHZ (1u)
#define DWC_DSTS_ENUMSPD_LS_PHY_6MHZ           (2u)
#define DWC_DSTS_ENUMSPD_FS_PHY_48MHZ          (3u)
            /** Erratic Error */
            unsigned errticerr:1;
            unsigned reserved4_7:4;
            /** Frame or Microframe Number of the received SOF */
            unsigned soffn:14;
            unsigned reserved22_31:10;
}stc_bUSB_CORE_DSTS_t;
typedef union 
{
    uint32_t d32;
    stc_bUSB_CORE_DSTS_t b;
} USB_CORE_DSTS_TypeDef;

typedef struct 
{
            /** Transfer complete mask */
            unsigned xfercompl:1;
            /** Endpoint disable mask */
            unsigned epdisabled:1;
            /** AHB Error mask */
            unsigned ahberr:1;
            /** TimeOUT Handshake mask (non-ISOC EPs) */
            unsigned timeout:1;
            /** IN Token received with TxF Empty mask */
            unsigned intktxfemp:1;
            /** IN Token Received with EP mismatch mask */
            unsigned intknepmis:1;
            /** IN Endpoint NAK Effective mask */
            unsigned inepnakeff:1;
            /** Reserved */
            unsigned emptyintr:1;

            unsigned txfifoundrn:1;

